proj/simpleFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 10;

vertices
(
	(-100 -200 40)		// 0 
	(100 -200 40) 	// 1
	(100 100 40)	// 2
	(-100 100 40)	// 3
	(-100 -200 41)	// 4
	(100 -200 41)	// 5
	(100 100 41)	// 6
	(-100 100 41)	// 7
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (20 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{
		type	patch;
		faces
		(
			(2 3 7 6)
		);
	}

	outlet
	{
		type 	patch;
		faces
		(
			(0 1 5 4)
		);
	}
	inner
	{
	  type wall;
	  faces
	  (
	    (0 1 2 3)
	  );
	}
	outer
	{
	  type wall;
	  faces
	  (
	    (4 5 6 7)
	  );
	}
	
    /*inlet
    {
        type patch;
        faces
        (
            (13 12 21 16)
            (14 13 16 18)
            (15 14 18 20)
            (17 22 12 13)
            (23 19 14 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 4 9 0)
            (2 6 4 1)
            (3 8 6 2)
            (5 1 0 10)
            (11 3 2 7)
        );
    }
    innerWall
    {
        type wall;
        faces
        (
            (2 1 13 14)
            (5 10 22 17)
            (5 17 13 1)
            (11 7 19 23)
            (7 2 14 19)
        );
    }
    outerWall
    {
        type wall;
        faces
        (
            (4 16 21 9)
            (6 18 16 4)
            (8 20 18 6)
        );
    }
    cyclic_half0
    {
        type cyclic;
        neighbourPatch cyclic_half1;
        transform rotational;
        rotationAxis (0 0 1);
        rotationCentre (0 0 0);
        faces
        (
            (0 9 21 12)
            (10 0 12 22)
        );
    }
    cyclic_half1
    {
        type cyclic;
        neighbourPatch cyclic_half0;
        transform rotational;
        rotationAxis (0 0 1);
        rotationCentre (0 0 0);
        faces
        (
            (3 15 20 8)
            (11 23 15 3)
        );
    }
*/

);

mergeMatchPairs
(
);

// ************************************************************************* //
