proj/simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       35572;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       35592;
    }
    inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1030;
        startFace       35612;
    }
    outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1034;
        startFace       36642;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60;
        startFace       37676;
    }
    blade
    {
        type            wall;
        inGroups        
2
(
bladeGroup
wall
)
;
        nFaces          5839;
        startFace       37736;
    }
)

// ************************************************************************* //
